//practiceA.pl
##################################
1
2 3
test
##################################
##################################
##################################
##################################
##################################
##################################
##################################
my $a = <STDIN>;
my $bc = <STDIN>;
my $s = <STDIN>;

my($b,$c)=split(/\s+/,$bc);

print $a + $b + $c," ",$s
##################################
# sample
# 変数a, b, c, sを宣言して、標準入力から値を読み込む
my $a = <STDIN>;
my ($b, $c) = split / /, <STDIN>;
my $s = <STDIN>;

# 出力
print $a + $b + $c, " ",  $s 
##################################
# 整数の入力
my $a = <STDIN>;
# スペース区切りの整数の入力
my $input = <STDIN>;
chomp $input;
my ($b, $c) = split / /, $input;
$ret = $a + $b + $c;
# 文字列の入力
my $s = <STDIN>;
chomp $s;
# 出力
print "$ret $s\n";
##################################
